import { formatUptime } from './_shared.js'

export default function classicMenu(p, owner, mode, uptimeSec) {
    const uptime = formatUptime(uptimeSec)

    return `╭─「 *✠ 𝐒̸𝐀̸𝐓̸𝐎̸𝐌̸𝐀̸𝐊̸𝐈̸-𝙼𝘿 ✠* 」
│ ╭╠M╣╠e╣╠n╣╠u╣╮
│
│ ┃ 👑 𝑵𝒐𝒎 : *𝐒̸𝐀̸𝐓̸𝐎̸𝐌̸𝐀̸𝐊̸𝐈̸-𝙼𝘿*
│ ┃ 🪽 𝒑𝒓𝒆𝒇𝒊𝒙 : *${p}*
│ ┃ 🌙 𝒗𝒆𝒓𝒔𝒊𝒐𝒏 : *𝟷.𝟶.𝟶*
│ ┃ ⏱️ 𝒖𝒑𝒕𝒊𝒎𝒆 : *${uptime}*
│ ┃ ⚔️ 𝑫é𝒗𝒆𝒍𝒐𝒑𝒑𝒆𝒖𝒓 : *(꧁⚡𝕹𝖔𝖛𝖆_𝕾𝖆𝖙𝖔𝖒𝖆𝖐𝖎⚡꧂)*
│ ╰━━━━━━━━━━━━━━
│
│   ✠━━━━━━━━━━━━━━━━━✠
│  👑👑👑 ⟭𝐒̸𝐀̸𝐓̸𝐎̸𝐌̸𝐀̸𝐊̸𝐈̸⟬ 👑👑👑
│   ⚜️ 𝑬𝒎𝒑𝒊𝒓𝒆 𝐒̸𝐀̸𝐓̸𝐎̸𝐌̸𝐀̸𝐊̸𝐈̸ ⚜️
│  𝑳𝒂 𝒍𝒖𝒎𝒊è𝒓𝒆 𝒂𝒑𝒑𝒆𝒍𝒍𝒆 𝒍𝒂 𝒍𝒖𝒎𝒊è𝒓𝒆
│  𝒍𝒆𝒔 *𝒕é𝒏è𝒃𝒓𝒆𝒔* *𝑨𝒑𝒑𝒆𝒍 𝒍𝒆𝒔 𝒕é𝒏è𝒃𝒓𝒆𝒔*
│   ✠━━━━━━━━━━━━━━━━━✠
│
│ 👥 *𝒄𝒐𝒎𝒎𝒂𝒏𝒅𝒆𝒔 𝒈𝒓𝒐𝒖𝒑𝒆*
│ 👥• ${p}𝙩𝙖𝙜
│ 🌟• ${p}𝙩𝙖𝙜𝙖𝙡𝙡
│ 🎉• ${p}𝙬𝙚𝙡𝙘𝙤𝙢𝙚 [𝚖𝚜𝚐]
│ 👋• ${p}𝙗𝙮𝙚 [𝚖𝚜𝚐]
│ 🔇• ${p}𝙢𝙪𝙩𝙚
│ 🔊• ${p}𝙪𝙣𝙢𝙪𝙩𝙚
│
│ ⚡ *𝒄𝒐𝒎𝒎𝒂𝒏𝒅𝒆𝒔 𝒂𝒅𝒎𝒊𝒏*
│ 🚷• ${p}𝙠𝙞𝙘𝙠𝙖𝙡𝙡
│ 🚫• ${p}𝙠𝙞𝙘𝙠 @𝚞𝚜𝚎𝚛
│ ⚡• ${p}𝙥𝙧𝙤𝙢𝙤𝙩𝙚 @𝚞𝚜𝚎𝚛
│ ⚡• ${p}𝙙𝙚𝙢𝙤𝙩𝙚 @𝚞𝚜𝚎𝚛
│ 🔗• ${p}𝙖𝙣𝙩𝙞𝙡𝙞𝙣𝙠
│ 🗑️• ${p}𝙙𝙚𝙡𝙚𝙩𝙚
│ 💥• ${p}𝙠𝙞𝙘𝙠𝙖𝙡𝙡𝟮
│
│ 🔧 *𝒄𝒐𝒎𝒎𝒂𝒏𝒅𝒆𝒔 𝒖𝒕𝒊𝒍𝒊𝒕𝒂𝒊𝒓𝒆𝒔*
│ 🏓• ${p}𝙥𝙞𝙣𝙜
│ ❤️• ${p}𝙖𝙡𝙞𝙫𝙚
│ 🖼️• ${p}𝙞𝙢𝙜 [𝚛𝚎𝚌𝚑𝚎𝚛𝚌𝚑𝚎]
│ 🎨• ${p}𝙛𝙖𝙣𝙘𝙮 [𝚝𝚎𝚡𝚝𝚎]
│ 💫• ${p}𝙘𝙞𝙩𝙖𝙩𝙞𝙤𝙣
│ 🔮• ${p}𝙙𝙚𝙫𝙞𝙣𝙚𝙩𝙩𝙚
│
│ 👑 *𝒄𝒐𝒎𝒎𝒂𝒏𝒅𝒆 𝒐𝒘𝒏𝒆𝒓*
│ 🌐• ${p}𝙥𝙪𝙗𝙡𝙞𝙘
│ 🕶️• ${p}𝙥𝙧𝙞𝙫𝙖𝙩𝙚
│ 👀• ${p}𝙫𝙫
│ 🔍• ${p}𝙫𝙫𝟮
│ 🎵• ${p}𝙖𝙪𝙙𝙞𝙤𝙪𝙧𝙡
│ 💣• ${p}𝙨𝙥𝙖𝙢 [𝚗𝚋] [𝚖𝚜𝚐]
│
│ 🪽━━━━━━━━━━━━━🪽
│ 𝑪𝒉𝒂𝒒𝒖𝒆 𝒍𝒂𝒎𝒆 𝒅𝒆𝒔 𝐒̸𝐀̸𝐓̸𝐎̸𝐌̸𝐀̸𝐊̸𝐈̸
│ 𝒕𝒓𝒂𝒗𝒆𝒓𝒔𝒆 𝒍𝒆𝒔 𝒎𝒐𝒏𝒅𝒆𝒔 𝒂𝒖 𝒏𝒐𝒎
│ 𝒅𝒆 𝒍'𝑬𝒎𝒑𝒆𝒓𝒆𝒖𝒓.
│
│ 𝑳𝒂 𝒈𝒍𝒐𝒊𝒓𝒆 𝒅𝒖 𝐒̸𝐀̸𝐓̸𝐎̸𝐌̸𝐀̸𝐊̸𝐈̸
│ 𝒏'𝒆𝒔𝒕 𝒑𝒂𝒔 𝒖𝒏𝒆 𝒑𝒓𝒐𝒎𝒆𝒔𝒔𝒆,
│ 𝒄'𝒆𝒔𝒕 𝒖𝒏 𝒅𝒆𝒔𝒕𝒊𝒏.
│ 🪽━━━━━━━━━━━━━🪽
│
│ 𝑳'𝑬𝒎𝒑𝒊𝒓𝒆 𝐒̸𝐀̸𝐓̸𝐎̸𝐌̸𝐀̸𝐊̸𝐈̸ 𝒏𝒆 𝒅𝒆𝒎𝒂𝒏𝒅𝒆
│ 𝒏𝒊 𝒑𝒆𝒓𝒎𝒊𝒔𝒔𝒊𝒐𝒏, 𝒏𝒊 𝒑𝒂𝒓𝒅𝒐𝒏.
│
│ 👑 𝑮𝒍𝒐𝒊𝒓𝒆 𝒂𝒖 𝐒̸𝐀̸𝐓̸𝐎̸𝐌̸𝐀̸𝐊̸𝐈̸ 👑
╰─────── ✠`
}
